In [6]:
import pandas as pd
import numpy as np
import seaborn as sns
from matplotlib import pyplot as plt

In [2]:
import sweetviz as sw

In [3]:
df=pd.read_csv('train.csv',sep=',')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df.shape

(891, 12)

In [7]:
analyze_report=sw.analyze(df)
analyze_report.show_html('output.html', open_browser=True)
plt.savefig('html.pdf')

                                             |                                              | [  0%]   00:00 -â€¦

Report output.html was generated! NOTEBOOK/COLAB USERS: the web browser MAY not pop up, regardless, the report IS saved in your notebook/colab files.

In [9]:
x=df.drop('Survived', axis=1)

In [10]:
y=df['Survived']

In [11]:
from sklearn.model_selection import train_test_split

In [12]:
xtrain,xtest,ytrain,ytest=train_test_split(x,y,test_size=0.3,random_state=32)

In [14]:
xtrain.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
446,447,2,"Mellinger, Miss. Madeleine Violet",female,13.0,0,1,250644,19.50,NaN,S
435,436,1,"Carter, Miss. Lucile Polk",female,14.0,1,2,113760,120.00,B96 B98,S
602,603,1,"Harrington, Mr. Charles H",male,NaN,0,0,113796,42.40,NaN,S
322,323,2,"Slayter, Miss. Hilda Mary",female,30.0,0,0,234818,12.35,NaN,Q
517,518,3,"Ryan, Mr. Patrick",male,NaN,0,0,371110,24.15,NaN,Q

In [16]:
report=sw.analyze(xtrain)
report.show_html('xtrain.html', open_browser=True)

                                             |                                              | [  0%]   00:00 -â€¦

Report xtrain.html was generated! NOTEBOOK/COLAB USERS: the web browser MAY not pop up, regardless, the report IS saved in your notebook/colab files.

In [17]:
comparison_report=sw.compare([xtrain,'Train'],[xtest,'Test'])
comparison_report.show_html('output.html', open_browser=True)

                                             |                                              | [  0%]   00:00 -â€¦

Report output.html was generated! NOTEBOOK/COLAB USERS: the web browser MAY not pop up, regardless, the report IS saved in your notebook/colab files.

In [18]:
df=df.dropna()

In [19]:
df.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

In [20]:
comparison_report=sw.compare([xtrain,'Train'],[xtest,'Test'])
comparison_report.show_html('output.html', open_browser=True)

                                             |                                              | [  0%]   00:00 -â€¦

Report output.html was generated! NOTEBOOK/COLAB USERS: the web browser MAY not pop up, regardless, the report IS saved in your notebook/colab files.